In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = pd.read_csv("Customers.csv")

In [3]:
df

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...,...
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

In [4]:
df.head()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [5]:
df.tail()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

In [6]:
df.shape

(2000, 8)

In [7]:
df.size

16000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   int64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Profession              1965 non-null   object
 6   Work Experience         2000 non-null   int64
 7   Family Size             2000 non-null   int64
dtypes: int64(6), object(2)
memory usage: 125.1+ KB

In [9]:
df.dtypes

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income ($)          int64
Spending Score (1-100)     int64
Profession                object
Work Experience            int64
Family Size                int64
dtype: object

In [11]:
df.isnull().sum()

CustomerID                 0
Gender                     0
Age                        0
Annual Income ($)          0
Spending Score (1-100)     0
Profession                35
Work Experience            0
Family Size                0
dtype: int64

In [13]:
df['Profession'].fillna(df['Profession'].mode()[0],inplace=True)

In [14]:
df.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income ($)         0
Spending Score (1-100)    0
Profession                0
Work Experience           0
Family Size               0
dtype: int64

In [34]:
df.describe()

,CustomerID,Age,Annual Income ($),Spending Score (1-100),Work Experience,Family Size
count,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000
mean,1000.500000,48.960000,110731.821500,50.962500,4.102500,3.768500
std,577.494589,28.429747,45739.536688,27.934661,3.922204,1.970749
min,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,500.750000,25.000000,74572.000000,28.000000,1.000000,2.000000
50%,1000.500000,48.000000,110045.000000,50.000000,3.000000,4.000000
75%,1500.250000,73.000000,149092.750000,75.000000,7.000000,5.000000
max,2000.000000,99.000000,189974.000000,100.000000,17.000000,9.000000

In [17]:
df.max()

CustomerID                     2000
Gender                         Male
Age                              99
Annual Income ($)            189974
Spending Score (1-100)          100
Profession                Marketing
Work Experience                  17
Family Size                       9
dtype: object

In [20]:
df.min()

CustomerID                     1
Gender                    Female
Age                            0
Annual Income ($)              0
Spending Score (1-100)         0
Profession                Artist
Work Experience                0
Family Size                    1
dtype: object

In [21]:
df.count()

CustomerID                2000
Gender                    2000
Age                       2000
Annual Income ($)         2000
Spending Score (1-100)    2000
Profession                2000
Work Experience           2000
Family Size               2000
dtype: int64

In [22]:
df['Age'].mean()

48.96

In [29]:
group = df[['Age','Annual Income ($)']]
print("Group:",group)

Group:       Age  Annual Income ($)
0      19              15000
1      21              35000
2      20              86000
3      23              59000
4      31              38000
...   ...                ...
1995   71             184387
1996   91              73158
1997   87              90961
1998   77             182109
1999   90             110610

[2000 rows x 2 columns]

In [35]:
group.describe()

               Age  Annual Income ($)
count  2000.000000        2000.000000
mean     48.960000      110731.821500
std      28.429747       45739.536688
min       0.000000           0.000000
25%      25.000000       74572.000000
50%      48.000000      110045.000000
75%      73.000000      149092.750000
max      99.000000      189974.000000

In [30]:
group.mean()

Age                      48.9600
Annual Income ($)    110731.8215
dtype: float64

In [31]:
group.median()

Age                      48.0
Annual Income ($)    110045.0
dtype: float64

In [32]:
group.mode()

    Age  Annual Income ($)
0  31.0               9000
1   NaN              50000

In [33]:
group.count()

Age                  2000
Annual Income ($)    2000
dtype: int64

In [36]:
group.std()

Age                     28.429747
Annual Income ($)    45739.536688
dtype: float64

In [37]:
group.min()

Age                  0
Annual Income ($)    0
dtype: int64

In [38]:
group.max()

Age                      99
Annual Income ($)    189974
dtype: int64

In [39]:
group.quantile(0.25)

Age                     25.0
Annual Income ($)    74572.0
Name: 0.25, dtype: float64

In [44]:
age_sum = df['Age'].sum()
age_sum

97920

In [45]:
age_count = df['Age'].count()
age_count

2000

In [46]:
age_mean = age_sum/age_count
print("Mean of age column:",age_mean)

Mean of age column: 48.96

In [47]:
df['Age'].mean()

48.96

In [48]:
max_count = df['Age'].count().max()
max_count

2000

In [49]:
Q1 = np.percentile(df['Age'],25)
Q2 = np.percentile(df['Age'],50)
Q3 = np.percentile(df['Age'],75)

print("Q1 25th percentile of data :",Q1)
print("Q2 50th percentile of data :",Q2)
print("Q3 75th percentile of data :",Q3)

IQR = Q3 - Q1
print("Iterquartile range = ",IQR)

Q1 25th percentile of data : 25.0
Q2 50th percentile of data : 48.0
Q3 75th percentile of data : 73.0
Iterquartile range =  48.0